package HomeWork12_26;

import java.util.Scanner;

/*
Составить программу возведения натурального числа в квадрат, учитывая
следующую закономерность: n n 1 3 5 7 9 ... 2 1 .
 */
public class Task5_86 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Введите число: ");
        int number = scanner.nextInt();

        int result =

    }
}